For some reasons, I ended up getting the following error.

```
Terraform will perform the following actions:

  # proxmox_lxc.test-clone will be created
  + resource "proxmox_lxc" "test-clone" {
      + arch         = "amd64"
      + clone        = "8000"
      + cmode        = "tty"
      + console      = true
      + cpulimit     = 0
      + cpuunits     = 1024
      + full         = true
      + hostname     = "test-clone"
      + id           = (known after apply)
      + memory       = 1024
      + onboot       = true
      + ostype       = (known after apply)
      + protection   = false
      + start        = true
      + swap         = 512
      + target_node  = "pve-02"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 0
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

proxmox_lxc.test-clone: Creating...
╷
│ Error: error cloning LXC container: 500 Linked clone feature for 'ssd-pool-01:8000/base-8000-disk-0.raw' is not available, error status:  (params: {"hostname":"test-clone","newid":100,"node":"pve-02","target":"pve-02","vmid":"8000"})
│
│   with proxmox_lxc.test-clone,
│   on test.tf line 16, in resource "proxmox_lxc" "test-clone":
│   16: resource "proxmox_lxc" "test-clone" {
│
╵
```